XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Cmsemicon.BAT32G133.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Cmsemicon</vendor>
  <name>BAT32G133</name>
  <description>Cmsemicon BAT32G133 Device Family Pack</description>
  <url>http://www.mcu.com.cn/pack/</url>

  <releases>
    <release version="1.1.5">
      Add enable and disable primask instruction in EraseChip(), EraseSector() and ProgramPage() in "flash.c".
      Fix the protect instruction in EraseChip(), EraseSector() and ProgramPage() in "flash.c".
    </release>
    <release version="1.1.4">
      Change DataFlash Programming Algorithm (delete EraseChip function)
    </release>
    <release version="1.1.3">
      Add DataFlash Programming Algorithm 
      Add VBGR A/D conversion value 
      Change system_BAT32G133.c to compatible with AC5 and AC6
      Change the name and address of TSCDR1 and TSCDR2
        TSCDR1 --> TSN25, TSCDR2 --> TSN85
    </release>
    <release version="1.1.2">
    ¦ Change the Dvendor with Keil official assigned code
      Change the vendor from CMS to Cmsemicon
    </release>
    <release version="1.1.1">
    ¦ Fix the UART1_Stop function
    ¦ Delete the call of NVIC_EnableIRQ function in Driver files
    </release>
    <release version="1.1.0">
      Remove some parts according to the product roadmap.
    </release>
    <release version="1.0.1">
      Remove some parts according to the product roadmap.
    </release>
    <release version="1.0.0">
      Initial Version
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Cmsemicon</keyword>
    <keyword>BAT32G133</keyword>
  </keywords>
  <!-- devices section (mandatory for Device Family Packs) -->
  <devices>
    <family Dfamily="M0+ Series" Dvendor="Cmsemicon:161">
      <!-- *************************  Sub Family 'BAT32G133'  ***************************** -->
      <subFamily DsubFamily="BAT32G133">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="48000000"/>
        <description>
          The BAT32G133 device family contains an ARM Cortex-M0+ processor, running up to 64 MHz with a versatile set of on-chip peripherals.
        </description>
        <compile  header="Device/Include/BAT32G133.h"/>
        <debug    svd="SVD/BAT32G133.svd"/>
        <algorithm  name="Flash/BAT32G133_DataFlash.FLM"    start="0x00500000"  size="0x00600"     default="1"/>
        <feature 	type="VCC"    		n="1.8" 	m="5.0"/>
        <feature 	type="Temp"          	n="-40"     	m="105"/>
        <feature 	type="DMA"          	n="24"     	name="Enhanced DMA"/>
        <feature 	type="XTAL"          	n="1000000"     m="20000000" 	name="External Crystal Oscillator"/>
        <feature 	type="IntRC"          	n="24000000"    m="64000000" 	name="Internal RC Oscillator with +/- 1% accuracy"/>
        <feature 	type="RTC"          	n="32768"                       name="Internal Real Time Clock(RTC)"/>
        <feature 	type="WDT"              n="1"/>
        <feature 	type="PowerMode"        n="3"                           name="Run, Sleep, Deep-Sleep"/>
        <feature 	type="PowerOther"       n="1"                           name="POR"/>
        <feature 	type="ADC"              n="15"          m="12"          name="High-Accuracy ADC"/>
        <feature 	type="AnalogOther"      n="2"                           name="PGA"/>
        <feature 	type="AnalogOther"      n="2"                           name="CMP"/>
        <feature 	type="TempSens"         n="1"                           name="Temperature Sensor"/>
        <feature 	type="I2C"              n="1"                           name="Full Function I2C"/>
        <feature 	type="SPI"              n="1"                           name="4-wire SPI"/>
        <feature 	type="SPI"              n="5"                           name="3-wire SPI"/>
        <feature 	type="UART"             n="3"/>
        <feature 	type="LIN"              n="1"/>
        <feature 	type="Timer"            n="4"           m="16"          name="General Purpose Timer (TIM40)"/>
        <feature 	type="Timer"            n="4"           m="16"          name="General Purpose Timer (TIM41)"/>
        <!-- *************************  Device 'BAT32G133GC20SA'  ***************************** -->
        <device Dname="BAT32G133GC20SA">
          <description>
            Code Flash: 32KB,  Data Flash: 1.5KB,  RAM: 4KB
            Package: 20-lead TSSOP(6.5x4.4mm, 0.65mm pitch)
          </description>
          <memory     name="IROM1"  access="rx"       start="0x00000000"  size="0x08000"     startup="1"   default="1"/>
          <memory     name="IRAM1"  access="rw"       start="0x20000000"  size="0x01000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/BAT32G133GC.FLM"    start="0x00000000"  size="0x08000"     default="1"/>
          <feature    type="Memory"         n="32000"                     name="Code Flash"/>
          <feature    type="Memory"         n="1536"                      name="Data Flash"/>
          <feature    type="SOP"            n="20"                        name="6.5x4.4mm, 0.65mm pitch TSSOP"/>
        </device>
        <!-- *************************  Device 'BAT32G133GC20NB'  ***************************** -->
        <device Dname="BAT32G133GC20NB">
          <description>
            Code Flash: 32KB,  Data Flash: 1.5KB,  RAM: 4KB
            Package: 20-lead QFN(3x3mm, 0.4mm pitch)
          </description>
          <memory     name="IROM1"  access="rx"       start="0x00000000"  size="0x08000"     startup="1"   default="1"/>
          <memory     name="IRAM1"  access="rw"       start="0x20000000"  size="0x01000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/BAT32G133GC.FLM"    start="0x00000000"  size="0x08000"     default="1"/>
          <feature    type="Memory"         n="32000"                     name="Code Flash"/>
          <feature    type="Memory"         n="1536"                      name="Data Flash"/>
          <feature    type="QFN"            n="20"                        name="3x3mm, 0.4mm pitch QFN"/>
        </device>
        <!-- *************************  Device 'BAT32G133GC24SS'  ***************************** -->
        <device Dname="BAT32G133GC24SS">
          <description>
            Code Flash: 32KB,  Data Flash: 1.5KB,  RAM: 4KB
            Package: 24-lead SSOP(8.65x3.9mm, 0.635mm pitch)
          </description>
          <memory     name="IROM1"  access="rx"       start="0x00000000"  size="0x08000"     startup="1"   default="1"/>
          <memory     name="IRAM1"  access="rw"       start="0x20000000"  size="0x01000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/BAT32G133GC.FLM"    start="0x00000000"  size="0x08000"     default="1"/>
          <feature    type="Memory"         n="32000"                     name="Code Flash"/>
          <feature    type="Memory"         n="1536"                      name="Data Flash"/>
          <feature    type="SOP"            n="24"                        name="8.65x3.9mm, 0.635mm pitch SSOP"/>
        </device>
        <!-- *************************  Device 'BAT32G133GC24NA'  ***************************** -->
        <device Dname="BAT32G133GC24NA">
          <description>
            Code Flash: 32KB,  Data Flash: 1.5KB,  RAM: 4KB
            Package: 24-lead QFN(7.8x4.4mm, 0.65mm pitch)
          </description>
          <memory     name="IROM1"  access="rx"       start="0x00000000"  size="0x08000"     startup="1"   default="1"/>
          <memory     name="IRAM1"  access="rw"       start="0x20000000"  size="0x01000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/BAT32G133GC.FLM"    start="0x00000000"  size="0x08000"     default="1"/>
          <feature    type="Memory"         n="32000"                     name="Code Flash"/>
          <feature    type="Memory"         n="1536"                      name="Data Flash"/>
          <feature    type="QFN"            n="24"                        name="4x4mm, 0.5mm pitch QFN"/>
        </device>
      </subFamily>
    </family>
  </devices>
  <!-- examples section (optional for all Software Packs)-->
  <examples>
    <example name="Blinky" doc="README" folder="Examples/Blinky">
      <description>Sample project</description>
      <board name="BAT32G133_EVB" vendor="Cmsemicon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
      </attributes>
    </example>
  </examples>
  
  <!-- conditions section (optional for all Software Packs)-->
  <conditions>
    <condition id="BAT32G133 CMSIS-CORE">
      <!-- conditions selecting Devices -->
      <description>Cmsemicon BAT32G133 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Cmsemicon:161" Dname="BAT32G133*"/>
    </condition>
    <condition id="Startup ARM">
      <description>Startup assembler file for ARMCC</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Startup GCC">
      <description>Startup assembler file for GCC</description>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Startup IAR">
      <description>Startup assembler file for IAR</description>
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  
  <!-- component section (optional for all Software Packs)-->
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="BAT32G133 CMSIS-CORE">
      <description>System Startup for Cmsemicon BAT32G133 Series</description>
      <files>
       <!--  include folder -->
       <file category="include" name="Device/Include/"/>

        <file category="source"  name="Device/Source/ARM/startup_BAT32G133.s" attr="config" condition="Startup ARM" version="1.0.0"/>
        <file category="source"  name="Device/Source/GCC/startup_BAT32G133.S" attr="config" condition="Startup GCC" version="1.0.0"/>
        <file category="source"  name="Device/Source/IAR/startup_BAT32G133.s" attr="config" condition="Startup IAR" version="1.0.0"/>

        <file category="source"  name="Device/Source/system_BAT32G133.c"  attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
  
</package>
